[
{"Headline": "WW2 veteran aged 102 dies on way to D-Day event ", "Summary": "Robert \"Al\" Persichitti, who served with the Navy in Japan, became ill on his way to Normandy."},
{"Headline": "Israelis using gardening tools to fight wildfires sparked by Hezbollah rockets", "Summary": "Residents of areas on the Israel-Lebanon border tell the BBC they \"feel like the forgotten people\"."},
{"Headline": "Why Canadians are angry with their biggest supermarket", "Summary": "Food prices, including a $40 chicken, has stoked fury and calls for big foreign supermarket chains to come to Canada."},
{"Headline": "WW2 veteran aged 102 dies on way to D-Day event ", "Summary": "Robert \"Al\" Persichitti, who served with the Navy in Japan, became ill on his way to Normandy."},
{"Headline": "Witnesses tell of 'unimaginable' Gaza shelter air strike", "Summary": "Dozens of people are reported to have been killed in the strike which Israel says targeted Hamas."},
{"Headline": "Watch: Space X Starship makes successful splashdown", "Summary": "The rocket made it much further in its planned mission profile than on previous tests, splashing down in the Indian Ocean."},
{"Headline": "Trump heads to Silicon Valley fundraiser on wave of support", "Summary": "Emboldened by billionaires like Elon Musk, some of tech's big names are turning to Donald Trump."},
{"Headline": "Why Canadians are angry with their biggest supermarket", "Summary": "Food prices, including a $40 chicken, has stoked fury and calls for big foreign supermarket chains to come to Canada."},
{"Headline": "In pictures: Events commemorate 80th anniversary of D-Day", "Summary": "Images from events to commemorate the 80th anniversary of the D-Day landings in France."},
{"Headline": "How French winemakers outwitted the Nazis", "Summary": "Winemakers played an essential role in the French Resistance, which helped pave the way for D-Day."},
{"Headline": "Gaza ceasefire plan turns into deadly game of survival", "Summary": "The plan outlined by President Biden could end the war, but both sides want to get their way."},
{"Headline": "Israelis using gardening tools to fight wildfires sparked by Hezbollah rockets", "Summary": "Residents of areas on the Israel-Lebanon border tell the BBC they \"feel like the forgotten people\"."},
{"Headline": "Mass graves and body bags: al-Shifa hospital after Israel withdrew its forces", "Summary": "The BBC has gained insight into what al-Shifa hospital is like since Israeli forces withdrew. "},
{"Headline": "Israel confirms deaths of four more hostages in Gaza", "Summary": "Israel's military says UK-Israeli Nadav Popplewell and three others \"were killed while together in the area of Khan Younis during our operation there\"."},
{"Headline": "Gaza ceasefire plan turns into deadly game of survival", "Summary": "The plan outlined by President Biden could end the war, but both sides want to get their way."},
{"Headline": "Where does Israel get its weapons?", "Summary": "Israel's military is heavily reliant on imported aircraft and munitions to conduct its war in Gaza."},
{"Headline": "Six months on, how close is Israel to eliminating Hamas?", "Summary": "BBC Verify assesses the evidence behind Israel's key war aim of destroying Hamas during its military operation in the Gaza Strip."},
{"Headline": "Gaza Strip in maps: How life has changed", "Summary": "Find out how much has changed in the Gaza Strip since Israel began its military response to Hamas's attacks on 7 October."},
{"Headline": "What are the historical reasons behind the conflict?", "Summary": "Tensions between Israel and the Palestinians date back decades, but what are the key issues?"},
{"Headline": "What does the ICJ's ruling on Israel's Rafah offensive mean?", "Summary": "Last week the UN's top court delivered the latest in a series of contested rulings in a case brought by S Africa."},
{"Headline": "What were the D-Day landings?", "Summary": "The King, Queen and Prince of Wales joined veterans to mark the Normandy landings' 80th anniversary."},
{"Headline": "D-Day left me flabbergasted, says WW2 veteran", "Summary": "Bill Davies, 101, landed at Arromanches in Normandy on 6 June 1944."},
{"Headline": "The humble heroes who kept their tales of war to themselves", "Summary": "Many children and grandchildren of those involved in D-Day rarely heard their relatives speak of war."},
{"Headline": "Myanmar soldiers cut off tattoos and gave detainees urine to drink, witnesses tell BBC", "Summary": "Witnesses tell the BBC the Myanmar army tortured and killed dozens of men in a village in Rakhine State."},
{"Headline": "How Japan's biggest brewer aims to attract sober Gen Z", "Summary": "Atsushi Katsuki tells the BBC the firm sees the sober generation as both a risk and an opportunity.\n"},
{"Headline": "Myanmar soldiers cut off tattoos and gave detainees urine to drink, witnesses tell BBC", "Summary": "Witnesses tell the BBC the Myanmar army tortured and killed dozens of men in a village in Rakhine State."},
{"Headline": "Endometriosis tormented her every month - and killed her aged 38", "Summary": "Jahmby Koikai spent most of her 38 years campaigning for better health care for women and girls."},
{"Headline": "Girl footballers told 'get back in the kitchen'", "Summary": "Lara, 17, said she had received all kinds of comments online. "},
{"Headline": "How Japan's biggest brewer aims to attract sober Gen Z", "Summary": "Atsushi Katsuki tells the BBC the firm sees the sober generation as both a risk and an opportunity.\n"},
{"Headline": "Premier League clubs vote in favour of keeping VAR", "Summary": "Wolves' proposal to scrap VAR has been voted down at the Premier League's annual general meeting.  "},
{"Headline": "Mechanic builds record-breaking 50mph wheelbarrow", "Summary": "In his ultimate man shed, Dylan built a motorised contraption out of a wheelbarrow and a scooter."},
{"Headline": "The impact of recognising a Palestinian state", "Summary": "Declarations by Ireland, Spain and Norway will put pressure on other countries in Europe. "},
{"Headline": "How plans for ‘the day after’ could help end war in Gaza", "Summary": "This subject will be on the table when EU and Middle Eastern foreign ministers meet."},
{"Headline": "What next as Ireland recognises Palestinian state?", "Summary": "Palestinians and critics of the move have given their reaction to BBC News NI."},
{"Headline": "What the ICC arrest warrants mean for Israel and Hamas", "Summary": "The Israeli and Hamas leaders are suspected of committing war crimes during the continuing war in Gaza."},
{"Headline": "Stories of the hostages taken by Hamas from Israel", "Summary": "It is thought 120 Israelis and foreigners remain unaccounted for after the 7 October attacks."},
{"Headline": "'I cannot comprehend a future without him'", "Summary": "James Kirby, 47, from Bristol, was one of seven aid workers killed in the attack in Gaza."},
{"Headline": "Rafah evacuation: 'Where will we go now?'", "Summary": "Palestinians have begun leaving parts of Rafah after Israel urged 100,000 people to evacuate the city."},
{"Headline": "'My children cling to me as dogs raid graves near our shelter'", "Summary": "In a tent yards from a cemetery, Rehab Abu Daqqa tries to shield her seven children from Rafah's horrors."},
{"Headline": "Premier League clubs vote in favour of keeping VAR", "Summary": "Wolves' proposal to scrap VAR has been voted down at the Premier League's annual general meeting.  "},
{"Headline": "Search under way after UK TV doctor goes missing in Greece", "Summary": "Dr Michael Mosley went missing on Wednesday after going for a walk while on holiday on the Greek island of Symi."},
{"Headline": "Shark seen regurgitating echidna in surprising first", "Summary": "Australian researchers were stunned to see the spiky, land-dwelling echidna emerge from a tiger shark."},
{"Headline": "'Vote or face war': Poland PM's stark warning ahead of EU election", "Summary": "Donald Tusk is urging Poles to vote for his coalition, to best protect against Russian aggression."},
{"Headline": "Zelensky accuses Russia and China of undermining summit", "Summary": "Both countries are trying to dissuade others from attending the upcoming event, Ukraine's president says."},
{"Headline": "Biden links WW2 and Ukraine war in D-Day address", "Summary": "Joe Biden says democracies are under threat, adding autocrats are \"watching what happens in Ukraine\". "},
{"Headline": "Mechanic builds record-breaking 50mph wheelbarrow", "Summary": "In his ultimate man shed, Dylan built a motorised contraption out of a wheelbarrow and a scooter."},
{"Headline": "Eze & Wharton named in England squad for Euro 2024", "Summary": "Crystal Palace pair Eberechi Eze and Adam Wharton are named in England's Euro 2024 squad, with Jack Grealish, Harry Maguire and James Maddison left out."},
{"Headline": "Swiatek to face Paolini in Paris final after dominating Gauff", "Summary": "Iga Swiatek continues her dominance over Coco Gauff to reach a third successive French Open final, where she will face Jasmine Paolini."},
{"Headline": "Eze & Wharton named in England squad for Euro 2024", "Summary": "Crystal Palace pair Eberechi Eze and Adam Wharton are named in England's Euro 2024 squad, with Jack Grealish, Harry Maguire and James Maddison left out."},
{"Headline": "Lacklustre Wales held by minnows Gibraltar", "Summary": "Follow live text commentary, score updates and match stats from Gibraltar v Wales in an international friendly."},
{"Headline": "Maguire 'absolutely gutted' to miss Euros with injury", "Summary": "Manchester United defender Harry Maguire says he is 'absolutely gutted' to miss out on being in England's Euros squad through injury"},
{"Headline": "Swiatek to face Paolini in Paris final after dominating Gauff", "Summary": "Iga Swiatek continues her dominance over Coco Gauff to reach a third successive French Open final, where she will face Jasmine Paolini."},
{"Headline": "'Vote or face war': Poland PM's stark warning ahead of EU election", "Summary": "Donald Tusk is urging Poles to vote for his coalition, to best protect against Russian aggression."},
{"Headline": "Russia link suspected in Eiffel Tower coffin mystery", "Summary": "Officials believe Moscow could be behind a stunt in which coffins filled with plaster were left near the Eiffel Tower."},
{"Headline": "'Russia now is like 1984': Inside a Russian dystopian library", "Summary": "Deep in Putin's Russia, Ivanovo's George Orwell library is still lending books on totalitarianism."},
{"Headline": "Zelensky accuses Russia and China of undermining summit", "Summary": "Both countries are trying to dissuade others from attending the upcoming event, Ukraine's president says."},
{"Headline": "Russia's economy is growing, but can it last?", "Summary": "Russia’s economy has been cut off from the global financial system - but it is still growing. Why?"},
{"Headline": "Will using Western weapons on Russia help Ukraine change the war?", "Summary": "The latest Russian advance in the Kharkiv region has convinced Kyiv’s allies to change their policy."},
{"Headline": "Jeremy Bowen: Ukraine faces its worst crisis since the war began", "Summary": "The composure Ukrainians show in the face of Russian attacks cannot conceal the dangers Kyiv faces in the summer ahead."},
{"Headline": "War and popularity keep Zelensky in power despite term expiring", "Summary": "Martial law and a desire for stability keeps the Ukrainian leader in power without new elections."},
{"Headline": "Russia could increase Ukraine attacks, says Zelensky", "Summary": "Moscow continues to make military gains in the Kharkiv region as Ukraine struggles with resources."},
{"Headline": "Gilgo Beach suspect charged with two more deaths", "Summary": "Rex Heuermann planned his crimes in \"excruciating detail\" in a computer \"blueprint\", say prosecutors. "},
{"Headline": "Biden links WW2 and Ukraine war in D-Day address", "Summary": "Joe Biden says democracies are under threat, adding autocrats are \"watching what happens in Ukraine\". "},
{"Headline": "Trump heads to Silicon Valley with eye on fundraising haul", "Summary": "Emboldened by billionaires like Elon Musk, some of tech's big names are turning to Donald Trump."},
{"Headline": "US south-west could see hottest temperatures yet ", "Summary": "Excessive heat warnings were in effect across parts of California, Nevada, Arizona and Texas. "},
{"Headline": "Gilgo Beach suspect charged with two more deaths", "Summary": "Rex Heuermann planned his crimes in \"excruciating detail\" in a computer \"blueprint\", say prosecutors. "},
{"Headline": "New York moves to revoke Trump's gun licence - reports", "Summary": "The former president will be banned from owning a firearm as a convicted criminal, US media says."},
{"Headline": "Boeing launches long-delayed astronaut capsule", "Summary": "US astronauts ride a new crew capsule to orbit after a long and tortuous development programme."},
{"Headline": "Trump's Georgia election fraud case delayed for months", "Summary": "The court will hear a challenge from Trump arguing that the District Attorney Fani Willis is conflicted. "},
{"Headline": "Meet the Peaky Blinders - Ukraine's drone squad defending Kharkiv", "Summary": "High-tech drones help Ukraine's defenders - but they say they need more support from allies."},
{"Headline": "Ukraine's defence lines stretched as Russian troops advance", "Summary": "The BBC's Jonathan Beale joins Ukrainian forces in Kharkiv as they try to shore up a weakened frontline."},
{"Headline": "The Russians simply walked in, Ukrainian troops in Kharkiv tell BBC", "Summary": "The BBC's Jonathan Beale meets front-line soldiers battling Russia's new incursion in north-east Ukraine."},
{"Headline": "Ukraine hit by 'massive' attack on energy grid", "Summary": "The attacks come as Ukraine marks a major national holiday celebrating the defeat of Nazi Germany. "},
{"Headline": "Seven dead in attack on Russia's Belgorod region", "Summary": "The governor of the border region says 35 people were also injured when a drone strike hit minibuses."},
{"Headline": "Biden border plan attacked by Republican rivals", "Summary": "The president has hit back at critics after unveiling plans to curb record migrant arrivals at the US-Mexico border."},
{"Headline": "Two-year-old killed in bed as tornado wrecks Michigan home", "Summary": "A fast-forming tornado caused a massive tree to uproot and fall on the family in their bed as they slept."},
{"Headline": "Watch: Space X Starship makes successful splashdown", "Summary": "The rocket made it much further in its planned mission profile than on previous tests, splashing down in the Indian Ocean."},
{"Headline": "Migrants react to Biden's new immigration plan", "Summary": "Under the president's executive order, officials can quickly remove migrants entering the US illegally."},
{"Headline": "Moment of lift-off for Boeing Starliner's first crewed mission", "Summary": "The spacecraft successfully launched from Cape Canaveral, Florida with two astronauts on board on Wednesday."},
{"Headline": "Former white nationalist: ‘I feel an enormous guilt’", "Summary": "The BBC spoke to R Derek Black, once described as the “heir” to America’s white nationalist movement."},
{"Headline": "First images of Hawaii's Kilauea volcano erupting", "Summary": "Helicopter overflight of Hawaii's Kilauea volcano after eruption."},
{"Headline": "Why Canadians are angry with their biggest supermarket", "Summary": "Food prices, including a $40 chicken, has stoked fury and calls for big foreign supermarket chains to come to Canada."},
{"Headline": "Trump heads to Silicon Valley with eye on fundraising haul", "Summary": "Emboldened by billionaires like Elon Musk, some of tech's big names are turning to Donald Trump."},
{"Headline": "Key family players at Hunter Biden's gun trial ", "Summary": "Hunter Biden's ex-wife, and former girlfriends are among those testifying at his criminal trial in Delaware. "},
{"Headline": "Biden walks difficult tightrope as son's gun trial begins", "Summary": "The president has \"boundless love\" for his son but Hunter's problems are being aired at a politically sensitive time."},
{"Headline": "Migrants and drugs - why Mexico's election matters to the US", "Summary": "Who is elected as Mexico's next president on Sunday will have repercussions on US-Mexico relations."}
]